package org.example.lessons.lesson12.homeworks

//Задачи на приведение коллекции к значению
//Проверить, что размер коллекции больше 5 элементов.
fun isBiggerThanFive(collection: Collection<*>): Boolean = collection.size > 5
//Проверить, что коллекция пустая
fun isEmpty(list: List<*>): Boolean = list.isEmpty()
//Проверить, что коллекция не пустая
fun isNotEnpty(list: List<*>): Boolean = list.isNotEmpty()
//Взять элемент по индексу или создать значение если индекса не существует
fun getElement() {
    var list = listOf<Int>(1, 2, 3, 4)
    val result = list.getOrElse(index = 2){5}
}
//Собрать коллекцию в строку
fun listToString(list: List<*>){ list.joinToString()
}
//Посчитать сумму всех значений
fun sumOfList(list: List<Int>){list.sum()}
//Посчитать среднее
fun averageList(list: List<Int>){list.average()}
//Взять максимальное число
fun maxOfList(list: List<Int>){list.maxOrNull()}
//Взять минимальное число
fun minOfList(list: List<Int>){list.minOrNull()}
//Взять первое число или null
fun firstOfList(list: List<Int>){list.firstOrNull()}
//Проверить что коллекция содержит элемент
fun ContainList(list: List<Int>): Boolean = list.contains(4)

//Задачи на обработку коллекций
val list = listOf<Int>()
val words = listOf("kotlin", "java", "scala", "go")
//Отфильтровать коллекцию по диапазону 18-30
val filtered = list.filter{it in 18..30}
//Выбрать числа, которые не делятся на 2 и 3 одновременно
val filterde2 = list.filterNot { it % 6 == 0  }

//Очистить текстовую коллекцию от null элементов
val filtered3 = list.filterNotNull()

//Преобразовать текстовую коллекцию в коллекцию длин слов
val listString = words.map { it.length }

//Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов

val map: Map<String, Int> = words.associate {
    word -> word.reversed() to word.length
}
//Отсортировать список в алфавитном порядке
val sortedWords = words.sorted()

//Взять первые 3 элемента списка
val threeWords = words.take(3)

//Распечатать квадраты элементов списка
val numbers = listOf(1, 2, 3, 4, 5)
val quads = numbers.forEach{it * it}

//Группировать список по первой букве слов
val groupList = words.groupBy {it.first() }

//Очистить список от дублей
val unique = words.distinct()

//Отсортировать список по убыванию
val desc = list.sortedDescending()

//Взять последние 3 элемента списка
val lastThree = words.takeLast(3)

//Задача 24. Характеристика числовой коллекции
//Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции используя конструкцию when
//
//Если коллекция пустая - “Пусто”
//Если количество элементов меньше пяти - “Короткая”
//Если коллекция начинается с 0 - “Стартовая”
//Если сумма всех чисел больше 10000 - “Массивная”
//Если среднее значение равно 10 - “Сбалансированная”
//Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
//Если максимальное число меньше -10 - “Отрицательная”
//Если минимальное число больше 1000 - “Положительная”
//Если содержит одновременно числа 3 и 14 - “Пи***тая”
//Иначе - “Уникальная”
//Вызвать метод с данными, подходящими под каждую из веток
//
fun characterize(numbers: List<Int>): String {
    return when {
        numbers.isEmpty() -> "Пусто"
        numbers.size < 5 -> "Короткая"
        numbers.first() == 0 -> "Стартовая"
        numbers.sum() > 10000 -> "Массивная"
        numbers.average() == 10.0 -> "Сбалансированная"
        numbers.joinToString("").length == 20 -> "Клейкая"
        numbers.max() < -10 -> "Отрицательная"
        numbers.min() > 1000 -> "Положительная"
        numbers.contains(3) && numbers.contains(14) -> "Пи***тая"
        else -> "Уникальная"
    }
}

//Задача 25. Анализ учебных оценок
//Напиши функцию, которая принимает список чисел и возвращает список чисел.
//
//Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//
//Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3. Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода являлся основой для следующего.
//

fun analyzeGrades(grades: List<Int>): List<Int> {
    return grades
        .filter { it >= 60 }      // 1. оставляем удовлетворительные (>= 60)
        .sorted()                 // 2. сортируем по возрастанию
        .take(3)                  // 3. берём первые 3
}

//Задача 26. Создание каталога по первой букве
//Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.
//
//Начальные значения: val list = listOf(
//"Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"
//)
//
//Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy
//
val list26 = listOf(
"Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"
)
fun mapCreator(list : List<String>){
   val catalog : Map<Char, List<String>> = list.map { it.lowercase() }.groupBy { it.first() }
    catalog.forEach { (letter, words) ->
        println("$letter: ${words.joinToString(", ")}")
    }
}

//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//
//Начальные значения взять из предыдущей задачи.
//
//Цель: Перевести все слова в количество букв, подсчитать среднее значение. Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.
//
fun averageLength(words: List<String>) :String{
    val average = words.map { it.length }.average()
    return String.format("%.2f", average)
}

//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.
//
//Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).
//
val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
fun categorizeNumbers(numbers: List<Int>): Map<String, List<Int>>{
    return numbers.distinct().sortedDescending().groupBy { if (it % 2 == 0) "четные" else "нечетные" }
}


//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//
//Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста, например 18.
//
//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его, либо null если значения не нашлось.

val ages = listOf(22, 18, 30, 45, 17, null, 60)
fun ageSearch(age: List<Int>, biggerThan: Int): Int?{
    return ages.firstOrNull{age -> age != null && age > biggerThan}
}
